export default {
  placeholder: "Введите e-mail",
  subscribe: "Подписаться",
  aboutHead: "О проекте",
  policy: "Политика конфиденциальности",
  projects: "Наши другие проекты",
  aboutText:
    "Платформа — это интерактивный тренажер для детей от 6 до 14 лет, по формированию эффективных управленческих команд развития бизнеса и территорий его нахождения.",
  socialHead: "Подпишитесь на наши новости",
  location:
    "Российская Федерация г. Москва, <br> м.Ботанический сад/м.ВДНХ, <br> ул. Сельскохозяйственная, д.17, к. 5",
  question: "Появились вопросы? <br> Свяжитесь с нами.",
  copyright: "Все права защищены"
};
