const slides = [
  {
    title: "О платформе 1",
    btn_text: false,
    image: false,
    information:
      "-это интерактивный тренажер для детей от 14 до 18 лет, по формированию эффективных управленческих команд развития  бизнеса и территорий его нахождения."
  },
  {
    btn_text: false,
    image: false,
    title: "О нас 2",
    information:
      "-это интерактивный тренажер для  детей от 14 до 18 лет, по формированию  эффективных управленческих команд развития  бизнеса и территорий его нахождения."
  },
  {
    btn_text: false,
    image: false,
    title: "О платформе 3",
    information:
      "-это интерактивный тренажер для детей от 14 до 18 лет, по формированию эффективных управленческих команд развития  бизнеса и территорий его нахождения."
  }
];

export default slides;
