const road_map = [
  {
    goal: "Цель №1",
    id: 1,
    tasks: [
      {
        task: "Задача №1",
        id: 11,
        missions: [
          { mission: "Задание №1", id: 111 },
          { mission: "Задание №2", id: 112 },
          { mission: "Задание №3", id: 113 }
        ]
      },
      {
        task: "Задача №2",
        id: 12,
        missions: [
          { mission: "Задание №1", id: 121 },
          { mission: "Задание №2", id: 122 }
        ]
      },
      {
        task: "Задача №3",
        id: 13,
        missions: [{ mission: "Задание №1", id: 131 }]
      }
    ]
  },
  {
    goal: "Цель №2",
    id: 2,
    tasks: [
      {
        task: "Задача №1",
        id: 21,
        missions: [{ mission: "Задание №1", id: 211 }]
      },
      {
        task: "Задача №2",
        id: 22,
        missions: [
          { mission: "Задание №1", id: 221 },
          { mission: "Задание №2", id: 222 }
        ]
      },
      {
        task: "Задача №3",
        id: 23,
        missions: [
          { mission: "Задание №1", id: 231 },

          { mission: "Задание №2", id: 232 },

          { mission: "Задание №3", id: 233 }
        ]
      },
      {
        task: "Задача №4",
        id: 24,
        missions: [
          { mission: "Задание №1", id: 241 },

          { mission: "Задание №2", id: 242 },

          { mission: "Задание №3", id: 243 },

          { mission: "Задание №4", id: 244 }
        ]
      }
    ]
  },
  {
    goal: "Цель №3",
    id: 3,
    tasks: [
      {
        task: "Задача №1",
        id: 31,
        missions: [
          { mission: "Задание №1", id: 311 },

          { mission: "Задание №2", id: 312 }
        ]
      },
      {
        task: "Задача №2",
        id: 32,
        missions: [
          { mission: "Задание №1", id: 321 },

          { mission: "Задание №2", id: 322 }
        ]
      },
      {
        task: "Задача №3",
        id: 33,
        missions: [
          { mission: "Задание №1", id: 331 },

          { mission: "Задание №2", id: 332 },

          { mission: "Задание №3", id: 333 }
        ]
      }
    ]
  }
];

// const road_map = {
//   goals: {
//     title: "Цели",
//     id: 1,
//     items: [
//       { name: "Цель №1", id: 11 },
//       { name: "Цель №1", id: 12 },
//       { name: "Цель №1", id: 13 },
//     ],
//   },
//   tasks: {
//     title: "Задачи",
//     id: 2,
//     items: [
//       [
//         { name: "Задача №1", id: 111 },
//         { name: "Задача №2", id: 112 },
//         { name: "Задача №3", id: 113 },
//       ],
//       [
//         { name: "Задача №1", id: 121 },
//         { name: "Задача №2", id: 122 },
//         { name: "Задача №3", id: 123 },
//         { name: "Задача №4", id: 124 },
//       ],
//       [
//         { name: "Задача №1", id: 131 },
//         { name: "Задача №2", id: 132 },
//         { name: "Задача №3", id: 133 },
//         { name: "Задача №4", id: 134 },
//         { name: "Задача №5", id: 135 },
//       ],
//     ],
//   },
//   missions: {
//     title: "Задания",
//     id: 3,
//     items: [
//       [
//         [
//           { name: "Задача №1", id: 1111 },
//           { name: "Задача №2", id: 1112 },
//           { name: "Задача №3", id: 1113 },
//         ],
//         [
//           { name: "Задача №1", id: 1121 },
//           { name: "Задача №2", id: 1122 },
//           { name: "Задача №3", id: 1123 },
//           { name: "Задача №4", id: 1124 },
//         ],
//         [
//           { name: "Задача №1", id: 1131 },
//           { name: "Задача №2", id: 1132 },
//           { name: "Задача №3", id: 1133 },
//           { name: "Задача №4", id: 1134 },
//           { name: "Задача №5", id: 1135 },
//         ],
//       ],
//       [
//         [
//           { name: "Задача №1", id: 1211 },
//           { name: "Задача №2", id: 1212 },
//           { name: "Задача №3", id: 1213 },
//         ],
//         [
//           { name: "Задача №1", id: 1221 },
//           { name: "Задача №2", id: 1222 },
//           { name: "Задача №3", id: 1223 },
//           { name: "Задача №4", id: 1224 },
//         ],
//         [
//           { name: "Задача №1", id: 1231 },
//           { name: "Задача №2", id: 1232 },
//           { name: "Задача №3", id: 1233 },
//           { name: "Задача №4", id: 1234 },
//           { name: "Задача №5", id: 1235 },
//         ],
//         [
//           { name: "Задача №1", id: 111 },
//           { name: "Задача №2", id: 112 },
//           { name: "Задача №3", id: 113 },
//         ],
//       ],
//       [
//         [
//           { name: "Задача №1", id: 1311 },
//           { name: "Задача №2", id: 1312 },
//           { name: "Задача №3", id: 1313 },
//         ],
//         [
//           { name: "Задача №1", id: 1321 },
//           { name: "Задача №2", id: 1322 },
//           { name: "Задача №3", id: 1323 },
//           { name: "Задача №4", id: 1324 },
//         ],
//         [
//           { name: "Задача №1", id: 1331 },
//           { name: "Задача №2", id: 1332 },
//           { name: "Задача №3", id: 1333 },
//           { name: "Задача №4", id: 1334 },
//           { name: "Задача №5", id: 1335 },
//         ],
//         [
//           { name: "Задача №1", id: 1341 },
//           { name: "Задача №2", id: 1342 },
//           { name: "Задача №3", id: 1343 },
//         ],
//         [
//           { name: "Задача №1", id: 1351 },
//           { name: "Задача №2", id: 1352 },
//           { name: "Задача №3", id: 1353 },
//           { name: "Задача №4", id: 1354 },
//           { name: "Задача №5", id: 1355 },
//         ],
//       ],
//     ],
//   },
// };
export default road_map;
